/*Використання "this" в об’єктному літералі (Задача)
важливість: 5
Тут функція makeUser повертає об’єкт.

Який результат доступу до його поля ref? Чому?

function makeUser() {
  return {
    name: "Іван",
    ref: this
  };
}

let user = makeUser();

 alert( user.ref.name ); // Який результат? */

/* - - - Моя відповідь - - - 
Коли я виводжу код, він показує мені пусте модальне вікно в браузері.
Хоча в теорії мало б показити якусь помилку.
Коротше, this в функції makeuser () не прив'язаний до жодного конкретного об'єкта
і тому, мабуть, мені нічого й не виводить, хоча б теоретично мало б бути undefined.
*/